testsuite/test-pybind/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       17936;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       18036;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          124;
        startFace       18136;
    }
    atmosphere
    {
        type            patch;
        nFaces          92;
        startFace       18260;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18144;
        startFace       18352;
    }
)

// ************************************************************************* //
